#include "workerManager.h"

// 在.cpp文件中补全其中的声明
// 构造函数
WorkerManager::WorkerManager()
{

}

// 析构函数
WorkerManager::~WorkerManager()
{

}

// 菜单功能和之前学生管理系统类似，只是纯粹的显示
void WorkerManager::Show_Meun()
{
    cout << "********************************************" << endl;
    cout << "***********  欢迎使用职工管理系统！ **********" << endl;
    cout << "*************  0.退出管理程序  *************" << endl;
    cout << "*************  1.增加职工信息  *************" << endl;
    cout << "*************  2.显示职工信息  *************" << endl;
    cout << "*************  3.删除离职职工  *************" << endl;
    cout << "*************  4.修改职工信息  *************" << endl;
    cout << "*************  5.查找职工信息  *************" << endl;
    cout << "*************  6.按照编号排序  *************" << endl;
    cout << "*************  7.清空所有文档  *************" << endl;
    cout << "********************************************" << endl;
    cout << endl;
}

// 退出系统
void WorkerManager:: Sys_Esc()
{
    cout << "退出系统，欢迎下次使用！";
    exit(0);
}